Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Поставщики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПоДокументу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокТоваровКоличествоПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее();		
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровЦенаПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее();
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровСуммаПриИзменении(Элемент)
	ТоварыРеквПриИзмененииОбщее(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРеквПриИзмененииОбщее(ИзменениеСуммы = Ложь)
	
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	Если ИзменениеСуммы Тогда
		ТекДанные.Цена = ?(ТекДанные.Количество <> 0, ТекДанные.Сумма / ТекДанные.Количество, 0);
	Иначе
		ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена;	
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СписокНоменклатурыНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;	
	ТекДанные.Цена = ПолучитьЦенуНоменклатуры(ТекДанные.Номенклатура);
	ТоварыРеквПриИзмененииОбщее();
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьЦенуНоменклатуры(Номенклатура)
	
	Возврат Вспомогательный.ПолучитьЦенуНоменклатуры(Номенклатура, Объект.ВидЦены, Объект.Дата);
	
КонецФункции

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение", ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаПодбораНоменклатуры",ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
		
	
КонецПроцедуры  

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		
		Для Каждого Стр Из Результат.СписокНоменклатуры Цикл
			СтрТЧ = Объект.СписокНоменклатуры.Добавить();
			СтрТЧ.Номенклатура = Стр;
			
			СтрТЧ.Цена = ПолучитьЦенуНоменклатуры(Стр);
				
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	Объект.ВидЦены = Объект.Контрагент.ВидЦены;
	ПересчитатьЦенуПоВидамЦен();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидЦеныПриИзменении(Элемент)
	
	ПересчитатьЦенуПоВидамЦен();	
	
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьЦенуПоВидамЦен()
	
	Для Каждого Стр Из Объект.СписокНоменклатуры Цикл			
		Стр.Цена = ПолучитьЦенуНоменклатуры(Стр.Номенклатура);
		Стр.Сумма = Стр.Количество * Стр.Цена;
	КонецЦикла;
		
КонецПроцедуры
